app/Controllers/Api/AdminController.php

    public function perfil()
    {
        $session = session();
        $id   = $session->get('id_usuario');   // 👈 debe coincidir con lo que guardas en login
        $rol  = $session->get('rol');

        // Validar sesión y rol
        if (!$id || strtolower($rol) !== 'admin') {
            return $this->response->setStatusCode(403)
                                  ->setJSON(['error' => 'No autorizado']);
        }

        $model = new UsuarioModel();
        $admin = $model->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '2'