app/Controllers/Api/AuthController.php

SELECT *
FROM `recuperar_clave`
WHERE `token` = '6055db32702ea3641824c3a133ac7bbb'
UPDATE `usuarios` SET `password_hash` = '$2y$10$YNptbrQvyIu4qBIzZ..PleeMje0n.TwhkwQgUAN.j5.mRGZhgW26u'
WHERE `usuarios`.`id_usuario` IN ('2')
DELETE FROM `recuperar_clave`
WHERE `token` = '6055db32702ea3641824c3a133ac7bbb'
---
    public function restablecer()
    {
        $data = $this->request->getJSON(true);
        $token = $data['token'] ?? null;
        $nuevaClave = $data['clave'] ?? null;

        if (!$token || !$nuevaClave) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Datos incompletos'
            ]);
        }

        $db = db_connect();
        $row = $db->table('recuperar_clave')->where('token', $token)->get()->getRowArray();

        if (!$row) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Token inválido o expirado'
            ]);
        }

        // Actualizar contraseña en usuarios
        $usuarioModel = new UsuarioModel();
        $usuarioModel->update($row['id_usuario'], [
            'password_hash' => password_hash($nuevaClave, PASSWORD_DEFAULT)
        ]);

        // Eliminar token usado
        $db->table('recuperar_clave')->where('token', $token)->delete();