app/Controllers/Api/EmpleadoController.php

    public function index()
    {
        $usuarios = (new UsuarioModel())->getEmpleados();
        $permisosModel = new PermisoModel();

        foreach ($usuarios as &$u) {
            $p = $permisosModel->where('id_usuario', $u['id_usuario'])->first();
---
SELECT *
FROM `permisos`
WHERE `id_usuario` = '37'
 LIMIT 1