app/Controllers/Api/PerfilController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '8'
---
    public function datos()
    {
        $idUsuario = session()->get('id_usuario');
        if (!$idUsuario) {
            return $this->response->setJSON(['status'=>'error','message'=>'No hay sesión activa']);
        }

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->find($idUsuario);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '1'
SELECT *
FROM `bloqueo_dpi`
WHERE `id_usuario` = '1'
---
    public function estadoDpi()
{
    $idUsuario = session()->get('id_usuario');
    if (!$idUsuario) {
        return $this->response->setJSON(['status'=>'error','message'=>'No hay sesión activa']);
    }

    $usuarioModel = new \App\Models\UsuarioModel();
    $usuario = $usuarioModel->find($idUsuario);

    // Calcular fecha de vencimiento (+10 años desde fecha_creacion)
    $fechaCreacion = new \DateTime($usuario['fecha_creacion']);
    $fechaVenc = (clone $fechaCreacion)->modify('+10 years');
    $hoy = new \DateTime();

    $vigente = $hoy <= $fechaVenc ? 'Vigente' : 'Vencido';

    // Verificar si está bloqueado
    $db = \Config\Database::connect();
    $bloqueo = $db->table('bloqueo_dpi')->where('id_usuario',$idUsuario)->get()->getRow();