app/Controllers/Api/ReporteController.php

    public function index()
    {
        $model = new ReporteModel();
        $data = $model->orderBy('fecha', 'DESC')->findAll();
---
SELECT *
FROM `reportes`
ORDER BY `fecha` DESC