app/Controllers/Api/UsuarioController.php

    public function index() {
        $model = new UsuarioModel();
        $usuarios = $model->findAll();
---
SELECT *
FROM `usuarios`