app/Controllers/AuthController.php

    public function login()
    {
        $cui   = $this->request->getPost('cui');
        $clave = $this->request->getPost('clave');
        $rolSeleccionado = $this->request->getPost('rol');

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->where('cui', $cui)->first();
---
SELECT *
FROM `usuarios`
WHERE `cui` = '9876543216785'
 LIMIT 1



                // Log de sesión exitosa
                $db->table('log_sesiones')->insert([
                    'id_usuario' => $usuario['id_usuario'],
                    'ip' => $ip,
                    'exitoso' => true
                ]);
---
INSERT INTO `log_sesiones` (`id_usuario`, `ip`, `exitoso`) VALUES ('37', '::1', 1)

                }
            } else {
                // Contraseña incorrecta
                $db->table('log_sesiones')->insert([
                    'id_usuario' => $usuario['id_usuario'],
                    'ip' => $ip,
                    'exitoso' => false
                ]);
---
INSERT INTO `log_sesiones` (`id_usuario`, `ip`, `exitoso`) VALUES ('8', '::1', 0)