app/Models/UsuarioModel.php

    public function getEmpleados()
{
    return $this->whereIn('rol', ['admin','operador'])->findAll();
---
SELECT *
FROM `usuarios`
WHERE `rol` IN ('admin','operador')